000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаВыдачиПаспорта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КемВыданПаспорт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПаспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСотрудника</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ФизическиеЛица/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЭтоГруппа И НЕ Сотрудник Тогда

		МассивНепроверяемыхРеквизитов = Новый Массив;
		МассивНепроверяемыхРеквизитов.Добавить("ДатаРождения");
		МассивНепроверяемыхРеквизитов.Добавить("Пол");
		МассивНепроверяемыхРеквизитов.Добавить("Магазин");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);

	ИначеЕсли ЭтоГруппа Тогда

		МассивНепроверяемыхРеквизитов = Новый Массив;
		МассивНепроверяемыхРеквизитов.Добавить("Магазин");
		МассивНепроверяемыхРеквизитов.Добавить("ОбособленноеПодразделение");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);

	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());

	Если ОбменДанными.Загрузка ИЛИ ТехническаяПоддержкаВызовСервера.ИсключительныйРежим() Тогда

		Возврат;

	КонецЕсли;

	Если НЕ ЭтоГруппа Тогда

		ИНН = СокрЛП(ИНН);

	//	LNK 02.04.2018 12:57:22
		Если ПроверитьУникальностьИНН(Отказ) Тогда

			Если Сотрудник И ПустаяСтрока(ИНН) Тогда

				Отказ = Истина;
				Сообщить("Отказано в записи! Для сотрудника должен быть указан ИНН.");

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Перем ВнешниеДанные;

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Если ДополнительныеСвойства.ЭтоНовый И ДополнительныеСвойства.Свойство("ВнешниеДанные", ВнешниеДанные) Тогда

		ОбменДаннымиЗУП.ФизЛицоФамилияИмяОтчество(Ссылка, ВнешниеДанные);
		ОбменДаннымиЗУП.ФизЛицоПаспорт(Ссылка, ВнешниеДанные);

	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	ИНН = "";
	ДатаРождения  = '00010101';
	НомерПаспорта = "";
	ДатаВыдачиПаспорта = '00010101';
	КемВыданПаспорт = "";

	КонтактнаяИнформация.Очистить();
	ДополнительныеРеквизиты.Очистить();

КонецПроцедуры

//	LNK 02.04.2018 12:55:56
Функция ПроверитьУникальностьИНН(Отказ)

	Если НЕ ПустаяСтрока(ИНН) Тогда

		УстановитьПривилегированныйРежим(Истина);

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТаблицаСправочник.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ТаблицаСправочник
		|ГДЕ
		|	ТаблицаСправочник.ИНН = &ИНН
		|	И НЕ ТаблицаСправочник.Ссылка = &ТекущаяСсылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование"
		);
		Запрос.УстановитьПараметр("ИНН", ИНН);
		Запрос.УстановитьПараметр("ТекущаяСсылка", Ссылка);
		
		Результат = Запрос.Выполнить();

		Если НЕ Результат.Пустой() Тогда

			Отказ = Истина;
			Сообщить("Отказано в записи! ИНН «" + ИНН + "» уже использован у следующих физ.лиц:");

			Выборка = Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл

				Сообщить(" - " + СокрЛП(Выборка.Наименование));

			КонецЦикла;

		КонецЕсли;

		УстановитьПривилегированныйРежим(Ложь);

	КонецЕсли;

	Возврат НЕ Отказ;

КонецФункции // ПроверитьУникальностьИНН()
